*&---------------------------------------------------------------------*
*& Report ZABA10_03_01_LOOP100
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zaba10_03_01_loop100.

*DO 10 TIMES.
*  WRITE / |Итерация цикла { sy-index } |.
*ENDDO.

DATA my_var TYPE i.

WHILE my_var < 15.

  WRITE  / | Значение переменной my_var = { my_var } |.
*  my_var = my_var + 1.
  ADD 1 TO my_var.

ENDWHILE.
